wjblanke/moviecart/firmware/stm32/src/main.c
/**
 * MovieCart on DevEBox STM32F407VGT6
 *
 * The Atari is served by UnoCart's polling loop with interrupts off for the
 * entire run. SDIO/DMA completion is polled manually in the driver; every SD
 * wait yields back into bus_serve_cycle() so RamKernel keeps running on the 6502.
 */
/* make NO_SD=1 builds the title-only baseline: the known-good reference. */
#ifndef MOVIECART_ENABLE_SD
#define MOVIECART_ENABLE_SD 1
#endif

#include <string.h>
#include <stdint.h>
#include <stdbool.h>

#include "stm32f4xx.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"
#include "misc.h"

#include "defines.h"
#include "cartridge_io.h"
#include "bus_service.h"
#include "moviecart_yield.h"
#include "core.h"
#include "pff.h"
#include "update.h"
#include "title_data.h"
#include "sd_reader.h"
#include "tm_stm32f4_delay.h"

extern struct coreInfo r_coreInfo;
extern struct fileSystemInfo fsInfo;
extern struct queueInfo qinfo;

struct stateVars state;
/*
 * Both field buffers live in SRAM2, the opposite AHB slave from the CPU's
 * stack, r_coreInfo, and the dispatch table in SRAM1. SD DMA only ever writes
 * SRAM2, so it cannot stall instruction/stack traffic even while a transfer is
 * in flight. bus_dispatch still reads the live field out of SRAM2 during
 * display; that is a different slave from the stack, so those two do not
 * contend with each other either.
 */
uint8_t mr_buffer1[FIELD_SIZE] __attribute__((aligned(16), section(".sram2")));
uint8_t mr_buffer2[FIELD_SIZE] __attribute__((aligned(16), section(".sram2")));

void updateInit(void);

static void
dwt_init(void)
{
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

/* Main-thread drain while waiting — lowest latency during display. */
static void
waitEndFrame(void)
{
	while (!r_coreInfo.mr_endFrame)
		bus_serve_cycle();
	r_coreInfo.mr_endFrame = 0;
}

/*
 * Block until VisibleBars ($F09D) is served — blanking in RIOT is done and the
 * cart-visible section of this frame is about to run.
 */
static void
waitVisibleBarsVended(void)
{
	mc_visible_bars_vended = 0;
	while (!mc_visible_bars_vended)
		bus_serve_cycle();
	mc_visible_bars_vended = 0;
}

/*
 * Blink by counting the kernel's own frames, not wall-clock milliseconds.
 *
 * Blinks used to be timed by moviecart_delay_ms, i.e. served through
 * moviecart_bus_pump. That is the right shape for an SD wait, but flash_led(1) is
 * 600 ms — roughly 700,000 cart cycles — and the pump pays per-cycle bookkeeping:
 * the pump_tick counter inside the drive window, the dead-bus guard state after
 * it. At that volume the small per-cycle cost accumulates into missed fetches and
 * kills the picture. SD_STAGE=1 proved it: no SD code runs in that build at all,
 * yet it went black immediately after its single blink, while the NO_SD baseline
 * (same code minus the blink) is pixel-perfect.
 *
 * waitEndFrame is the loop the baseline runs — one SRAM load between serves and
 * nothing else — so timing blinks off it costs the display nothing. At 60 Hz,
 * 9 frames is ~150 ms.
 *
 * The trade-off: a blink now needs a running kernel, so a fully dead console
 * shows no LED. Bounding the wait is what the dead-bus guard was for, and that
 * guard is repeatedly what breaks the display. A diagnostic that damages the
 * system it is measuring is worse than no diagnostic.
 */
#define LED_FRAMES_ON	9u	/* ~150 ms at 60 Hz */
#define LED_FRAMES_GAP	18u	/* ~300 ms */

static void
led_wait_frames(unsigned frames)
{
	while (frames--)
		waitEndFrame();
}

/*
 * Wall-clock blink timing, for the codes that report a *failure*.
 *
 * Frame-timed blinks are only calibrated while the kernel is healthy, which is
 * precisely when we do not need them. When the section machine desyncs,
 * mr_endFrame stops meaning "1/60 s" and starts firing spuriously fast, so a
 * frame-timed code compresses into an uncountable flicker — reported from
 * hardware as "blinking too rapidly to tell what they are reporting". A
 * diagnostic that becomes unreadable in the failure case is no diagnostic.
 *
 * DWT is independent of the kernel, so the code stays countable no matter how
 * badly the display has desynced. The catch that made blinks dangerous before was
 * never the clock source, it was *what runs between serves*: reading a counter
 * after every serve is per-cycle work, and over the ~700k cycles of a blink that
 * is enough to jam the 6507. So the deadline is sampled once per LED_CHECK_EVERY
 * serves, leaving the hot loop byte-identical to the baseline's — the same
 * arrangement wait_title_sync already uses successfully.
 */
#define LED_CHECK_EVERY	256u		/* ~214 us between samples */

static void
led_wait_ms(uint32_t ms)
{
	uint32_t start = DWT->CYCCNT;
	uint32_t limit = (SystemCoreClock / 1000u) * ms;

	do {
		for (unsigned i = 0; i < LED_CHECK_EVERY; i++)
			bus_serve_cycle();
	} while ((DWT->CYCCNT - start) < limit);
}

/*
 * Deliberately slow and lopsided so a code can be counted by eye: a long "here
 * comes a code" lead-in, then clearly separated flashes.
 */
static void
flash_led_slow(uint8_t num)
{
	mc_led_host = 1;	/* keep the kernel heartbeat off this LED */
	TESTA0_HIGH;
	led_wait_ms(1200);
	for (uint8_t i = 0; i < num; i++) {
		TESTA0_LOW;
		led_wait_ms(300);
		TESTA0_HIGH;
		led_wait_ms(400);
	}
	TESTA0_HIGH;
	led_wait_ms(1200);
	/* mc_led_host stays set: a failure code repeats forever and must never
	 * be interleaved with the heartbeat between repeats. */
}

/*
 * Milestone codes are wall-clock timed too, for the same reason the failure
 * codes are: a milestone is reported at exactly the moment the thing it reports
 * on might have broken the kernel. Frame-timed, a blink that begins with the LED
 * lit and then loses the kernel never reaches its TESTA0_HIGH — waitEndFrame
 * spins forever on an mr_endFrame that has stopped arriving. That is read from
 * hardware as "two flashes with the LED remaining on", which hides whether the
 * next milestone was reached at all. DWT does not care whether the display is
 * alive, and led_wait_ms samples it once per 256 serves, so the hot loop stays
 * as cheap as the frame-timed version's.
 */
#define LED_MS_ON	150u
#define LED_MS_GAP	300u

static void
flash_led(uint8_t num)
{
	mc_led_host = 1;	/* keep the kernel heartbeat off this LED */
	TESTA0_HIGH;
	for (uint8_t i = 0; i < num; i++) {
		TESTA0_LOW;
		led_wait_ms(LED_MS_ON);
		TESTA0_HIGH;
		led_wait_ms(LED_MS_ON);
	}
	TESTA0_HIGH;
	led_wait_ms(LED_MS_GAP);
	mc_led_host = 0;
}

#if MOVIECART_GAP_PROBE
/*
 * Report the worst serve-to-serve gap, then run the plain loop.
 *
 * Two blink groups, separated by a long pause:
 *   first  = region, 1..8 (see MC_PHASE_* in bus_service.h): 1-5 are one-time
 *            init, 6-8 are the per-sector read path (6 command/arm, 7 DMA drain,
 *            8 card-ready poll). 9 would mean no region was ever marked, i.e.
 *            distrust the reading rather than silently blaming region 1.
 *   second = gap size in whole Atari cycles (1 = under one cycle, i.e. fine),
 *            capped at 9
 *
 * The values are snapshotted before blinking, because blinking serves the bus
 * and would otherwise overwrite what we are trying to read out. Blinks are
 * wall-clock timed so the report stays countable even if the kernel is desynced.
 */
void
mc_probe_report(void)
{
	uint8_t phase = mc_gap_worst_phase;
	uint32_t cycles = mc_gap_max_cycles;
	uint32_t per_atari = SystemCoreClock / 1190000u;	/* ~141 @ 168 MHz */
	uint8_t bars = (uint8_t)(cycles / per_atari) + 1u;

	if (bars > 9u)
		bars = 9u;

	/* Wall-clock timed: a probe report is worthless if a desynced kernel
	 * compresses it into an unreadable flicker. */
	led_wait_ms(1500);
	flash_led_slow(phase ? phase : 9u);
	led_wait_ms(1500);
	flash_led_slow(bars);

	emulate_cartridge();
}
#endif

static void
config_gpio_data(void)
{
	GPIO_InitTypeDef gpio;

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

	gpio.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 |
			GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	gpio.GPIO_Mode = GPIO_Mode_IN;
	gpio.GPIO_OType = GPIO_OType_PP;
	/*
	 * Identical to UnoCart's config_gpio_data(), which is proven on this
	 * board: no pull, and GPIO_Speed is deliberately left ineffective —
	 * GPIO_Init only programs OSPEEDR for OUT/AF modes, so these pins keep
	 * the 2 MHz reset-default slew even when flipped to output at runtime.
	 * Forcing 100 MHz here rings and cross-talks on breadboard wiring.
	 */
	gpio.GPIO_Speed = GPIO_Speed_25MHz;
	gpio.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOD, &gpio);
}

static void
config_gpio_addr(void)
{
	GPIO_InitTypeDef gpio;

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);

	gpio.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 |
			GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
			GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 |
			GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	gpio.GPIO_Mode = GPIO_Mode_IN;
	gpio.GPIO_OType = GPIO_OType_PP;
	gpio.GPIO_Speed = GPIO_Speed_100MHz;
	gpio.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOE, &gpio);
}

static void
config_status_led(void)
{
	GPIO_InitTypeDef gpio;

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

	gpio.GPIO_Pin = STATUS_LED_PIN;
	gpio.GPIO_Mode = GPIO_Mode_OUT;
	gpio.GPIO_OType = GPIO_OType_PP;
	gpio.GPIO_Speed = GPIO_Speed_2MHz;
	gpio.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(STATUS_LED_GPIO, &gpio);
	TESTA0_HIGH;
}

static void
copy_title(uint8_t *dst, const uint8_t *src, int size)
{
	while (size > 0) {
		*dst++ = *src++;
		size--;
		if (!(size & 7))
			moviecart_bus_yield();
	}
}

static void
setupTitleBuffers(void)
{
	r_coreInfo.frameInfo.buffer = mr_buffer1;
	r_coreInfo.mr_frameInfo1.buffer = mr_buffer1;
	r_coreInfo.mr_frameInfo2.buffer = mr_buffer2;

