wjblanke/moviecart/firmware/stm32/src/main.c
	frameInitTitle(&r_coreInfo.frameInfo, 0);
	frameInitTitle(&r_coreInfo.mr_frameInfo1, 0);
	frameInitTitle(&r_coreInfo.mr_frameInfo2, 1);

	memset(mr_buffer1, 0, sizeof(mr_buffer1));
	memset(mr_buffer2, 0, sizeof(mr_buffer2));

	r_coreInfo.frameInfo = r_coreInfo.mr_frameInfo1;
}

static void
loadTitlePixels(void)
{
	int lineTotal = r_coreInfo.mr_frameInfo1.visibleLines * 5;

	copy_title(r_coreInfo.mr_frameInfo1.graphBuf, TitleGraph1, lineTotal);
	copy_title(r_coreInfo.mr_frameInfo1.colorBuf, TitleColor1, lineTotal);
	copy_title(r_coreInfo.mr_frameInfo1.colorBKBuf, TitleBackColor1,
		   r_coreInfo.mr_frameInfo1.visibleLines);

	copy_title(r_coreInfo.mr_frameInfo2.graphBuf, TitleGraph2, lineTotal);
	copy_title(r_coreInfo.mr_frameInfo2.colorBuf, TitleColor2, lineTotal);
	copy_title(r_coreInfo.mr_frameInfo2.colorBKBuf, TitleBackColor2,
		   r_coreInfo.mr_frameInfo2.visibleLines);
}

/*
 * Main has nothing to do here, so it becomes the (faster) bus server:
 * IRQs masked, tight drain — ~100-150 ns response vs ~300+ ns via EXTI.
 * DWT keeps time (it counts with IRQs masked).
 */
/*
 * Do not "optimise" the cycle-counter read out of this loop. It looks like the
 * same after-serve gap that had to be removed from the SD waits, and it was
 * changed twice on that reasoning — moving the deadline into the pump's free
 * window, then sampling it once per 4096 cycles. Both builds were worse on
 * hardware than this one: the first jammed every boot (the pump is the bounded
 * serve, and its dead-bus hint latches during sync, when the guard expiring is
 * normal), and the second lost the picture before the first blink. Sync is not
 * the accumulating-gap case the SD waits were — it lasts one frame, not 100k
 * cycles — and this exact shape is what reliably reaches the first blink.
 */
static int
wait_title_sync(uint32_t timeout_ms)
{
	uint32_t start = DWT->CYCCNT;
	uint32_t limit = (SystemCoreClock / 1000u) * timeout_ms;
	int ok = 0;

	r_coreInfo.mr_endFrame = 0;

	__disable_irq();
	while ((DWT->CYCCNT - start) < limit) {
		bus_serve_cycle();
		if (r_coreInfo.mr_endFrame) {
			r_coreInfo.mr_endFrame = 0;
			ok = 1;
			break;
		}
	}
	return ok;
}

#if MOVIECART_STALL_TEST && MOVIECART_STALL_TEST != 3
/*
 * Stall the bus loop for a known time, serving nothing. This is the thing we are
 * measuring: exactly what an SDIO command wait or a FatFs cluster walk does to
 * the Atari. DWT keeps counting with interrupts masked.
 *
 * The polling loop costs a handful of cycles per iteration, so the shortest steps
 * of the fine schedule overshoot their nominal figure somewhat. That only makes
 * the result conservative: a step that passes really did stall at least that long.
 */
static void
stall_ns(uint32_t ns)
{
	uint32_t start = DWT->CYCCNT;
	uint32_t limit = ns * (SystemCoreClock / 1000000u) / 1000u;

	while ((DWT->CYCCNT - start) < limit)
		;
}

/*
 * Sweep the stall length upward, announcing each step on the status LED, and let
 * the display be the verdict. The LED is dark for the whole of each test window,
 * so the pattern reads as: N flashes, dark test window, N+1 flashes, ...
 *
 * Step 1 stalls for nothing and must look identical to the normal title build; it
 * is the control. The first step whose window garbles the picture bounds the
 * budget, and the previous step is what any SD restructuring has to fit inside.
 *
 * STALL_TEST=1 sweeps microseconds, to find out whether whole missed Atari cycles
 * are survivable. STALL_TEST=2 sweeps the sub-cycle region, to find out how much
 * of a single 838 ns cycle is actually slack — that is what bounds the size of a
 * cooperative work step, and it also re-tests the old "settle window" result
 * against a proper 0 ns control.
 */
#define STALL_TEST_FRAMES	300u	/* ~5 s per step; the failure is intermittent */

static __attribute__((noreturn)) void
run_stall_sweep(void)
{
#if MOVIECART_STALL_TEST == 2
	static const uint16_t steps_ns[] = { 0, 100, 200, 300, 400, 600, 800, 1000 };
#else
	static const uint16_t steps_ns[] = {
		0, 1000, 2000, 4000, 8000, 16000, 32000, 64000
	};
#endif

	__disable_irq();

	/* Lock onto a complete frame first, as the title build does. */
	while (!r_coreInfo.mr_endFrame)
		bus_serve_cycle();
	r_coreInfo.mr_endFrame = 0;

	for (;;) {
		for (unsigned s = 0; s < sizeof(steps_ns) / sizeof(steps_ns[0]); s++) {
			flash_led((uint8_t)(s + 1));
			led_wait_frames(42);	/* countable gap; bus stays served */

			for (unsigned f = 0; f < STALL_TEST_FRAMES; f++) {
				waitEndFrame();
				if (steps_ns[s])
					stall_ns(steps_ns[s]);
			}
		}
	}
}
#elif MOVIECART_STALL_TEST == 3
/*
 * Interleave proof: one 100 ns cooperative step every cart cycle, injected in
 * bus_service.c after SET_DATA_MODE_OUT. Three announcement flashes, then the
 * kernel's normal 1-flash-per-second diagnostic owns the LED. Clean title +
 * that heartbeat means cooperative SD stepping is viable; garble means the
 * end-of-frame slack does not transfer to mid-cycle work.
 */
static __attribute__((noreturn)) void
run_interleave_proof(void)
{
	__disable_irq();

	flash_led(3);
	led_wait_frames(42);

	emulate_cartridge();
}
#endif /* MOVIECART_STALL_TEST */

static __attribute__((noreturn)) void fatalBlink(uint8_t code);

static __attribute__((noreturn)) void
fatalBlink(uint8_t code)
{
	__disable_irq();
	for (;;)
		flash_led_slow(code);	/* wall-clock: readable even with a desynced kernel */
}

/*
 * One specific finding gets a pattern instead of a count: a long 2 s on, short
 * off. It means the failed field read succeeded when repeated into the SRAM2
 * scratch buffer, i.e. the SRAM1 field buffer is the bad DMA target rather than a
 * wrong-sector computation. Counting flashes by eye is unreliable, and this result
 * is too important to risk misreading — it decides which layer to fix.
 */
static __attribute__((noreturn)) void
fatalStrobe(void)
{
	__disable_irq();
	mc_led_host = 1;
	for (;;) {
		TESTA0_LOW;
		led_wait_ms(2000);
		TESTA0_HIGH;
		led_wait_ms(400);
	}
}

/*
 * Was the field readable into SRAM2 but not SRAM1?
 *
 * Re-reads the exact sector the failed field read used, this time into the SRAM2
 * scratch buffer (disk_read_block1). The raw read path is identical; only the DMA
 * destination region differs. The two outcomes need opposite fixes:
 *
 *   valid MVC\0 in scratch  -> the sector is right and the read works; the SRAM1
 *                              field buffer is a bad DMA target (contention or a
 *                              coherency gap against the per-cycle bus_dispatch).
 *   wrong in scratch too    -> we computed the wrong sector; the FAT walk / seek is
 *                              at fault, and the destination region is innocent.
 *
 * Caller must re-seek first so pf_current_sector() names the field's first sector.
 */
static int
field_reads_ok_in_scratch(uint32_t offset)
{
	pf_seek_block(offset);
	const uint8_t *scratch = disk_read_block1(pf_current_sector());
	return memcmp(scratch, "MVC\0", 4) == 0;
}

