wjblanke/moviecart/firmware/stm32/src/main.c
	r_coreInfo.mr_frameInfo1.visibleLines += diff;
	r_coreInfo.mr_frameInfo2.visibleLines += diff;
	r_coreInfo.mr_frameInfo1.totalLines += diff;
	r_coreInfo.mr_frameInfo2.totalLines += diff;

	while (m_titleFrame--) {
		waitEndFrame();
		coreInfoToState();
		updateTransport(&state);
		if (state.io_bits & STATE_PLAYING)
			break;
	}

	if (!mc_sd_prepare_playback_read())
		fatalBlink(BLINK_SECTOR_READ);
}

/*
 * Zeroing both field buffers is several kilobytes of stores. Done in one memset
 * it silences the cart for tens of microseconds mid-playback, so clear it in
 * small chunks and serve a cycle between each.
 */
static void
clearFieldBuffers(void)
{
	const uint32_t chunk = 64;

	for (uint32_t off = 0; off < sizeof(mr_buffer1); off += chunk) {
		uint32_t n = sizeof(mr_buffer1) - off;

		if (n > chunk)
			n = chunk;
		memset(&mr_buffer1[off], 0, n);
		memset(&mr_buffer2[off], 0, n);
		moviecart_bus_yield();
	}
}

static int select_which;

static void
select_open_work(void)
{
	disk_open_ok = pf_open_file(&state.i_numFrames, select_which);
}

static void
checkSelectVideo(int *which)
{
	if ((state.io_bits & STATE_END) ||
	    ((state.i_swchb & 0x02) && !((uint8_t)r_coreInfo.mr_swchb & 0x02))) {
		state.io_bits &= ~STATE_END;

		(*which)++;
		for (;;) {
			select_which = *which;
			select_open_work();
			if (disk_open_ok)
				break;
			*which = 1;
		}

		qinfo.head = 0;
		for (int i = 0; i < QUEUE_SIZE; i++) {
			qinfo.block[i] = 0xffffffffu;
			qinfo.clust[i] = 0xffffffffu;
			if (!(i & 7))
				moviecart_bus_yield();
		}

		state.io_frameNumber = 1;
		state.io_bits |= STATE_PLAYING;

		clearFieldBuffers();

		for (int i = 0; i < 30; i++)
			waitEndFrame();
	}

	coreInfoToState();
}

static void
runFrameLoop(void)
{
	int which = 1;

	state.io_frameNumber = 1;
	state.io_bits = STATE_PLAYING;

	while (1) {
		waitEndFrame();

		checkSelectVideo(&which);
		updateTransport(&state);

		/*
		 * VisibleBars RTS ($F41D) marks the start of the RIOT blanking
		 * tail. prepareNextFrame() calls into FatFs/disk_read; the SDIO
		 * driver waits for a fresh mc_blanking_window_gen edge before each
		 * command, poll, or DMA drain. If the load finishes before the next
		 * VisibleBars entry, keep serving until $F09D.
		 */
		mc_visible_bars_vended = 0;
		uint8_t frame_fault = prepareNextFrame();

		if (frame_fault)
			fatalBlink(frame_fault);
		while (!mc_visible_bars_vended)
			bus_serve_cycle();
	}
}

int
main(void)
{
	config_gpio_data();
	config_gpio_addr();
	config_status_led();
	dwt_init();

	/*
	 * IRQs stay masked for the entire Atari serve run. SDIO/DMA completion is
	 * polled in the driver; long waits use moviecart_delay_ms (yields each
	 * iteration). TM_DELAY_Init is kept for library helpers that use TM_Time.
	 */
	__disable_irq();
	TM_DELAY_Init();

	/* Everything the kernel dispatch touches must be valid before serving
	 * starts, but nothing slow may run before the drain: the console's RC
	 * reset releases the 6507 a few tens of ms after power-on, and its
	 * very first vector fetches decide whether it lives or jams. */
	coreInit();
	setupTitleBuffers();
	loadTitlePixels();

#if MOVIECART_STALL_TEST == 3
	run_interleave_proof();
#elif MOVIECART_STALL_TEST
	run_stall_sweep();
#elif MOVIECART_ENABLE_SD
	MC_PROBE(MC_PHASE_PRE_SD);
	if (!wait_title_sync(3000u))
		fatalBlink(6);
	flash_led(1);

	setupDisk();

	updateInit();
	runTitle();
	runFrameLoop();
#else
	emulate_cartridge();
#endif
}
